# South Korea Business Registration Numbers

## Introduction

The function `clean_kr_brn()` cleans a column containing South Korea Business Registration Number (BRN) strings, and standardizes them in a given format. The function `validate_kr_brn()` validates either a single BRN strings, a column of BRN strings or a DataFrame of BRN strings, returning `True` if the value is valid, and `False` otherwise.

BRN strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "1348672683"
* `standard`: BRN strings with proper whitespace in the proper places, like "134-86-72683"

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_kr_brn()` and `validate_kr_brn()`.

### An example dataset containing BRN strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "brn": [
            "1348672683",
            "123456789",
            "51824753556",
            "51 824 753 556",
            "hello",
            np.nan,
            "NULL"
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

              brn                                           address
0      1348672683                                     123 Pine Ave.
1       123456789                                           main st
2     51824753556                      1234 west main heights 57033
3  51 824 753 556                    apt 1 789 s maple rd manhattan
4           hello                robie house, 789 north main street
5             NaN  (staples center) 1111 S Figueroa St, Los Angeles
6            NULL                                             hello

## 1. Default `clean_kr_brn`

By default, `clean_kr_brn` will clean brn strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_kr_brn
clean_kr_brn(df, column = "brn")

,brn,address,brn_clean
0,1348672683,123 Pine Ave.,134-86-72683
1,123456789,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_kr_brn(df, column = "brn", output_format="standard")

,brn,address,brn_clean
0,1348672683,123 Pine Ave.,134-86-72683
1,123456789,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `compact`

In [4]:
clean_kr_brn(df, column = "brn", output_format="compact")

,brn,address,brn_clean
0,1348672683,123 Pine Ave.,1348672683
1,123456789,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned BRN strings is added with a title in the format `"{original title}_clean"`.

In [5]:
clean_kr_brn(df, column="brn", inplace=True)

      brn_clean                                           address
0  134-86-72683                                     123 Pine Ave.
1           NaN                                           main st
2           NaN                      1234 west main heights 57033
3           NaN                    apt 1 789 s maple rd manhattan
4           NaN                robie house, 789 north main street
5           NaN  (staples center) 1111 S Figueroa St, Los Angeles
6           NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [6]:
clean_kr_brn(df, "brn", errors="coerce")

,brn,address,brn_clean
0,1348672683,123 Pine Ave.,134-86-72683
1,123456789,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `ignore`

In [7]:
clean_kr_brn(df, "brn", errors="ignore")

,brn,address,brn_clean
0,1348672683,123 Pine Ave.,134-86-72683
1,123456789,main st,123456789
2,51824753556,1234 west main heights 57033,51824753556
3,51 824 753 556,apt 1 789 s maple rd manhattan,51 824 753 556
4,hello,"robie house, 789 north main street",hello
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 4. `validate_kr_brn()`

`validate_kr_brn()` returns `True` when the input is a valid BRN. Otherwise it returns `False`.

The input of `validate_kr_brn()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_kr_brn()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_kr_brn()` returns the validation result for the whole DataFrame.

In [8]:
from dataprep.clean import validate_kr_brn
print(validate_kr_brn("1348672683"))
print(validate_kr_brn("123456789"))
print(validate_kr_brn("51824753556"))
print(validate_kr_brn("51 824 753 556"))
print(validate_kr_brn("hello"))
print(validate_kr_brn(np.nan))
print(validate_kr_brn("NULL"))

True
False
False
False
False
False
False

### Series

In [9]:
validate_kr_brn(df["brn"])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
Name: brn, dtype: bool

### DataFrame + Specify Column

In [10]:
validate_kr_brn(df, column="brn")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
Name: brn, dtype: bool

### Only DataFrame

In [11]:
validate_kr_brn(df)

     brn  address
0   True    False
1  False    False
2  False    False
3  False    False
4  False    False
5  False    False
6  False    False